Revit 2027 API
ElectricalSetting.AddDistributionSysType Method
 Add a new distribution system type to project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DistributionSysType AddDistributionSysType(
	string name,
	ElectricalPhase phase,
	ElectricalPhaseConfiguration phaseConfig,
	int numWire,
	VoltageType volLineToLine,
	VoltageType volLineToGround
)
Public Function AddDistributionSysType (
	name As String,
	phase As ElectricalPhase,
	phaseConfig As ElectricalPhaseConfiguration,
	numWire As Integer,
	volLineToLine As VoltageType,
	volLineToGround As VoltageType
) As DistributionSysType
public:
DistributionSysType^ AddDistributionSysType(
	String^ name,
	ElectricalPhase phase,
	ElectricalPhaseConfiguration phaseConfig,
	int numWire,
	VoltageType^ volLineToLine,
	VoltageType^ volLineToGround
)
member AddDistributionSysType :
        name : string *
        phase : ElectricalPhase *
        phaseConfig : ElectricalPhaseConfiguration *
        numWire : int *
        volLineToLine : VoltageType *
        volLineToGround : VoltageType -> DistributionSysType
Parameters
name String
The name of new added distribution system type
phase ElectricalPhase
Single or three phase this type is
phaseConfig ElectricalPhaseConfiguration
Configuration property of given phase
numWire Int32
Wire number of this distribution system
volLineToLine VoltageType
Type of line to line voltage in this system
volLineToGround VoltageType
Type of line to ground voltage in this system
Return Value
DistributionSysType
New added distribution system type object.
Exceptions
Exception | Condition
ArgumentException |  The name can't be null, empty string, or equal with any existing one, phaseConfig should be defined and numWire can only be 3 or 4 in case of three phase, numWire can only be 2 or 3 in case of single phase, otherwise exception will be thrown.
See Also
Reference
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace